package lect2.additionaltasks;

public class Main {
    public static void main(String[] args)
    {

    }

    // TODO: Вместо void указать правильный тип данных
    public static void sort(Integer [] arr)
    {
        //TODO: Реализовать алгоритм, который выполнит сортировку массива arr по убыванию.
        // Результат вывести в консоль
    }

    public static void printNums()
    {
        Integer[] arr = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10};

        //TODO: Реадзовать цикл, который переберёт все элементы массива arr и выполнить следующее
        // 1) Если текущий элемент массива находится в промежутке {1..3}, вывести значение текущего элемента в консоль.
        // 2) Если текущий элемент массива находится в промежутке {4..6} продолжить цикл без вывода значения текущего элемента в консоль.
        // 3) Если текущий элемент == 9, то необходимо прервать выполнение цикла.
        // 4) Если не выполнено ни одно из условий, вывести в консоль строку : "Не знаю что делать"
        // ВАЖНО: в реализации должен быть использован switch
    }
}
