package lect2.additionaltasks;

public class Main {
    public static void main(String[] args)
    {

    }

    // TODO: Вместо void указать правильный тип данных (если это необходимо)
    public static void sort(Integer [] arr)
    {
        //TODO: Реализовать алгоритм, который выполнит пузырьковую сортировку массива arr по убыванию.
        // Алгоритм сортировки найти самостоятельно.
        // Результат вывести в консоль
    }

    public static void printNums()
    {
        Integer[] arr = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10};

        //TODO: Реализовать цикл, который переберёт все элементы массива arr и выполнить следующее
        // 1) Если текущий элемент массива находится в промежутке {1..3}, вывести значение текущего элемента в консоль.
        // 2) Если текущий элемент массива находится в промежутке {4..6} продолжить цикл без вывода значения текущего элемента в консоль.
        // 3) Если текущий элемент == 9, то необходимо прервать выполнение цикла.
        // 4) Если не выполнено ни одно из условий, вывести в консоль строку : "Не знаю что делать"
        // ВАЖНО: в реализации должны быть использованы switch, break, continue, default
    }

    public static void fib(Integer n)
    {
        //TODO: Реализовать алгоритм, который выводит первые n чисел ряда Фибоначчи(1, 1, 2, 3, 5...)
    }

    public static void fact(Integer n)
    {
        //TODO: Реализовать алгоритм, который выводит факториал входного параметра n
    }
}
